import math
'''
Подключение модуля math (набор функций для математических вычислений)
'''

def area(r):
    '''
    Принимает десятичное число r - радиус.
    Возвращает десятичное число (по формуле S = πr²) - площадь круга.

    Примечание: π = 3.141592653589793.
    '''
    return math.pi * r * r


def perimeter(r):
    '''
    Принимает десятичное число r - радиус.
    Возвращает десятичное число (по формуле P = 2πr) - периметр круга.
    
    Примечание: π = 3.141592653589793.
    '''
    return 2 * math.pi * r